zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/periph/PERI_QDC.h
#define QDC_CTRL2_SABIE_MASK                     (0x400U)
#define QDC_CTRL2_SABIE_SHIFT                    (10U)
/*! SABIE - Simultaneous PHASEA and PHASEB Change Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define QDC_CTRL2_SABIE(x)                       (((uint16_t)(((uint16_t)(x)) << QDC_CTRL2_SABIE_SHIFT)) & QDC_CTRL2_SABIE_MASK)

#define QDC_CTRL2_SABIRQ_MASK                    (0x800U)
#define QDC_CTRL2_SABIRQ_SHIFT                   (11U)
/*! SABIRQ - Simultaneous PHASEA and PHASEB Change Interrupt Request
 *  0b0..No simultaneous change has occurred
 *  0b1..A simultaneous change has occurred
 */
#define QDC_CTRL2_SABIRQ(x)                      (((uint16_t)(((uint16_t)(x)) << QDC_CTRL2_SABIRQ_SHIFT)) & QDC_CTRL2_SABIRQ_MASK)

#define QDC_CTRL2_INITPOS_MASK                   (0x1000U)
#define QDC_CTRL2_INITPOS_SHIFT                  (12U)
/*! INITPOS - Initialize Position Registers
 *  0b0..Don't initialize position counter
 *  0b1..Initialize position counter
 */
#define QDC_CTRL2_INITPOS(x)                     (((uint16_t)(((uint16_t)(x)) << QDC_CTRL2_INITPOS_SHIFT)) & QDC_CTRL2_INITPOS_MASK)

#define QDC_CTRL2_EMIP_MASK                      (0x2000U)
#define QDC_CTRL2_EMIP_SHIFT                     (13U)
/*! EMIP - Enables/disables the position counter to be initialized by Index Event Edge Mark
 *  0b0..Disable
 *  0b1..Enable
 */
#define QDC_CTRL2_EMIP(x)                        (((uint16_t)(((uint16_t)(x)) << QDC_CTRL2_EMIP_SHIFT)) & QDC_CTRL2_EMIP_MASK)
/*! @} */

/*! @name UMOD - Upper Modulus */
/*! @{ */

#define QDC_UMOD_MOD_MASK                        (0xFFFFU)
#define QDC_UMOD_MOD_SHIFT                       (0U)
/*! MOD - MOD */
#define QDC_UMOD_MOD(x)                          (((uint16_t)(((uint16_t)(x)) << QDC_UMOD_MOD_SHIFT)) & QDC_UMOD_MOD_MASK)
/*! @} */

/*! @name LMOD - Lower Modulus */
/*! @{ */

#define QDC_LMOD_MOD_MASK                        (0xFFFFU)
#define QDC_LMOD_MOD_SHIFT                       (0U)
/*! MOD - MOD */
#define QDC_LMOD_MOD(x)                          (((uint16_t)(((uint16_t)(x)) << QDC_LMOD_MOD_SHIFT)) & QDC_LMOD_MOD_MASK)
/*! @} */

/*! @name UCOMP - Upper Position Compare */
/*! @{ */

#define QDC_UCOMP_COMP_MASK                      (0xFFFFU)
#define QDC_UCOMP_COMP_SHIFT                     (0U)
/*! COMP - COMP */
#define QDC_UCOMP_COMP(x)                        (((uint16_t)(((uint16_t)(x)) << QDC_UCOMP_COMP_SHIFT)) & QDC_UCOMP_COMP_MASK)
/*! @} */

/*! @name LCOMP - Lower Position Compare */
/*! @{ */

#define QDC_LCOMP_COMP_MASK                      (0xFFFFU)
#define QDC_LCOMP_COMP_SHIFT                     (0U)
/*! COMP - COMP */
#define QDC_LCOMP_COMP(x)                        (((uint16_t)(((uint16_t)(x)) << QDC_LCOMP_COMP_SHIFT)) & QDC_LCOMP_COMP_MASK)
/*! @} */

/*! @name LASTEDGE - Last Edge Time */
/*! @{ */

#define QDC_LASTEDGE_LASTEDGE_MASK               (0xFFFFU)
#define QDC_LASTEDGE_LASTEDGE_SHIFT              (0U)
/*! LASTEDGE - Last Edge Time Counter */
#define QDC_LASTEDGE_LASTEDGE(x)                 (((uint16_t)(((uint16_t)(x)) << QDC_LASTEDGE_LASTEDGE_SHIFT)) & QDC_LASTEDGE_LASTEDGE_MASK)
/*! @} */

/*! @name LASTEDGEH - Last Edge Time Hold */
/*! @{ */

#define QDC_LASTEDGEH_LASTEDGEH_MASK             (0xFFFFU)
#define QDC_LASTEDGEH_LASTEDGEH_SHIFT            (0U)
/*! LASTEDGEH - Last Edge Time Hold */
#define QDC_LASTEDGEH_LASTEDGEH(x)               (((uint16_t)(((uint16_t)(x)) << QDC_LASTEDGEH_LASTEDGEH_SHIFT)) & QDC_LASTEDGEH_LASTEDGEH_MASK)
/*! @} */

/*! @name POSDPER - Position Difference Period Counter */
/*! @{ */

#define QDC_POSDPER_POSDPER_MASK                 (0xFFFFU)
#define QDC_POSDPER_POSDPER_SHIFT                (0U)
/*! POSDPER - Position difference period */
#define QDC_POSDPER_POSDPER(x)                   (((uint16_t)(((uint16_t)(x)) << QDC_POSDPER_POSDPER_SHIFT)) & QDC_POSDPER_POSDPER_MASK)
/*! @} */

/*! @name POSDPERBFR - Position Difference Period Buffer */
/*! @{ */

#define QDC_POSDPERBFR_POSDPERBFR_MASK           (0xFFFFU)
#define QDC_POSDPERBFR_POSDPERBFR_SHIFT          (0U)
/*! POSDPERBFR - Position difference period buffer */
#define QDC_POSDPERBFR_POSDPERBFR(x)             (((uint16_t)(((uint16_t)(x)) << QDC_POSDPERBFR_POSDPERBFR_SHIFT)) & QDC_POSDPERBFR_POSDPERBFR_MASK)
/*! @} */

/*! @name POSDPERH - Position Difference Period Hold */
/*! @{ */

#define QDC_POSDPERH_POSDPERH_MASK               (0xFFFFU)
#define QDC_POSDPERH_POSDPERH_SHIFT              (0U)
/*! POSDPERH - Position difference period hold */
#define QDC_POSDPERH_POSDPERH(x)                 (((uint16_t)(((uint16_t)(x)) << QDC_POSDPERH_POSDPERH_SHIFT)) & QDC_POSDPERH_POSDPERH_MASK)
/*! @} */

/*! @name CTRL3 - Control 3 */
/*! @{ */

#define QDC_CTRL3_PMEN_MASK                      (0x1U)
#define QDC_CTRL3_PMEN_SHIFT                     (0U)
/*! PMEN - Period Measurement Function Enable
 *  0b0..Not used
 *  0b1..Used
 */
#define QDC_CTRL3_PMEN(x)                        (((uint16_t)(((uint16_t)(x)) << QDC_CTRL3_PMEN_SHIFT)) & QDC_CTRL3_PMEN_MASK)

#define QDC_CTRL3_PRSC_MASK                      (0xF0U)
#define QDC_CTRL3_PRSC_SHIFT                     (4U)
/*! PRSC - Prescaler */
#define QDC_CTRL3_PRSC(x)                        (((uint16_t)(((uint16_t)(x)) << QDC_CTRL3_PRSC_SHIFT)) & QDC_CTRL3_PRSC_MASK)

#define QDC_CTRL3_CMP1IRQ_MASK                   (0x200U)
#define QDC_CTRL3_CMP1IRQ_SHIFT                  (9U)
/*! CMP1IRQ - Compare1 Interrupt Request
 *  0b0..No match has occurred (the counter does not match the COMP1 value)
 *  0b1..COMP1 match has occurred (the counter matches the COMP1 value)
 */
#define QDC_CTRL3_CMP1IRQ(x)                     (((uint16_t)(((uint16_t)(x)) << QDC_CTRL3_CMP1IRQ_SHIFT)) & QDC_CTRL3_CMP1IRQ_MASK)
/*! @} */

/*! @name UCOMP1 - Upper Position Compare1 Register */
/*! @{ */

#define QDC_UCOMP1_COMP_MASK                     (0xFFFFU)
#define QDC_UCOMP1_COMP_SHIFT                    (0U)
/*! COMP - COMP */
#define QDC_UCOMP1_COMP(x)                       (((uint16_t)(((uint16_t)(x)) << QDC_UCOMP1_COMP_SHIFT)) & QDC_UCOMP1_COMP_MASK)
/*! @} */

/*! @name LCOMP1 - Lower Position Compare1 Register */
/*! @{ */

#define QDC_LCOMP1_COMP_MASK                     (0xFFFFU)
#define QDC_LCOMP1_COMP_SHIFT                    (0U)
/*! COMP - COMP */
#define QDC_LCOMP1_COMP(x)                       (((uint16_t)(((uint16_t)(x)) << QDC_LCOMP1_COMP_SHIFT)) & QDC_LCOMP1_COMP_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group QDC_Register_Masks */


/*!
 * @}
 */ /* end of group QDC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma pop
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_QDC_H_ */

